{
    "LAT_REQUIRED": "A latitude deve ser informada.",
    "LAT_INVALID": "A latitude deve ser diferente de zero.",
    "LON_REQUIRED": "A longitude deve ser informada.",
    "LON_INVALID": "A longitude deve ser diferente de zero.",
    "PRECISON_REQUIRED": "A precisão deve ser informada.",
    "PRICE_REQUIRED": "O preço deve ser informado.",
    "BUSINESS_TYPE_REQUIRED": "O tipo de negócio deve ser informado.",
    "BUSINESS_TYPE_INVALID": "O tipo de negócio deve ser SALE (venda) ou RENTAL (aluguel).",
    "USABLE_AREAS_REQUIRED": "A área útil deve ser informada.",
    "USABLE_AREAS_INVALID": "A área útil deve ser maior ou igual a zero.",
    "LISTING_TYPE_REQUIRED": "O tipo de lista deve ser informado.",
    "LISTING_STATUS_REQUIRED": "A situação da lista deve ser informada.",
    "PARKING_SPACES_REQUIRED": "O número de vagas de estacionamento deve ser informado.",
    "PARKING_SPACES_INVALID": "O número de vagas de estacionamento deve ser maior ou igual a zero.",
    "BATHROOMS_REQUIRED": "O número de banheiros deve ser informado.",
    "BATHROOMS_INVALID": "O número de banheiros deve ser maior ou igual a zero.",
    "BEDROOMS_REQUIRED": "O número de quartos deve ser informado.",
    "BEDROOMS_INVALID": "O número de quartos deve ser maior ou igual a zero.",
    "IMAGES_REQUIRED": "As imagens devem ser informadas.",
    "IMAGES_INVALID": "O número de imagens deve ser maior ou igual a 1.",
    "PAGE_NUMBER_REQUIRED": "O número da página deve ser informado.",
    "PAGE_NUMBER_INVALID": "O número da página deve ser maior do que zero e menor ou igual ao total de páginas.",
    "PAGE_SIZE_REQUIRED": "O número de registros por página deve ser informado.",
    "PAGE_SIZE_INVALID": "O número de registros por página deve ser maior ou igual a um.",
    "TOTAL_PAGES_REQUIRED": "O número total de páginas deve ser informado.",
    "TOTAL_PAGES_INVALID": "O número total de páginas deve ser maior ou igual a um.",
    "LISTINGS_REQUIRED": "Deve haver ao menos um registro por página.",
    "LISTINGS_INVALID": "O número de registros deve ser menor ou igual ao total de registros por página.",
    "USERNAME_REQUIRED": "O nome do usuário deve ser informado.",
    "PASSWORD_REQUIRED": "A senha do usuário deve ser informada.",
    "PARTNER_ID_REQUIRED": "O código do parceiro ao qual o usuário pertence deve ser informado.",
    "IDENTITY_REQUIRED": "A identidade deve ser informada.",
    "EXPIRES_IN_REQUIRED": "O tempo de expiração em minutos, deve ser informado.",
    "EXPIRES_IN_INVALID": "O tempo de expiração deve ser um número inteiro.",
    "CLAIMS_PROP_REQUIRED": "O valor do atributo deve ser informada.",
    "AUTHORIZATION_INVALID": "A autorização informada é inválida.",
    "SECRET_REQUIRED": "O segredo deve ser informada."
}